app/Models/ClientesModel.php

INSERT INTO `clientes` (`nome`, `sobrenome`, `cpf`) VALUES ('Josefa', 'Maria', '44455566677')
---
    public function insertClientes(array $cliente)
    {

        $cpf = $cliente['cpf'];
        $length = mb_strlen($cpf);

        $this->confereCPF($cpf, $length);

        $this->save($cliente);

SELECT *
FROM `clientes`
SELECT *
FROM `clientes`
WHERE `cpf` = '74106399934'
 LIMIT 1
---
    public function getClientes(string $cpf = null)
    {

        $data = [];

        if ($cpf === null || empty($cpf)) {
            $data = $this->findAll();
        } else {
            $this->confereCPF($cpf, mb_strlen($cpf));

            $data = [$this->where('cpf', $cpf)->first()];

UPDATE `clientes` SET `nome` = 'Isauro', `sobrenome` = 'Marcinho', `cpf` = '74106399934'
WHERE `clientes`.`id` IN ('55')
---
    public function updateClientes(array $cliente, array $cliente_antigo)
    {
        $cpf_antigo = $cliente_antigo['cpf_antigo'];
        $cpf = $cliente['cpf'];

        $data = $this->getClientes($cpf_antigo);
        $id = $data[0]['id'];
        $length = mb_strlen($cpf);

        $this->confereCPF($cpf, $length);

        $this->update($id, $cliente);

SELECT *
FROM `clientes`
WHERE `cpf` = '00044455511'
 LIMIT 1
DELETE FROM `clientes`
WHERE `id` IN ('5','Maria','Silva','00044455511')
---
    public function deleteClientes(string $cpf)
    {
        $length = mb_strlen($cpf);

        $this->confereCPF($cpf, $length);

        $cliente = $this->where(['cpf' => $cpf])->first();

        return $this->delete($cliente);